WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  // Setup alternate buffer's address
  // DMA2 Channel 0 Memory Address Register 1
  regval = _dmaDataBuffer2;
  putreg32(regval, STM32_DMA2_S0M1AR);
#endif

  // (--) CALLING DMA ISR NEED WORK-THE CODE TO ASSIGN THE ISR ISN'T WRITTEN
  // //       1/2 full         full          transfer err  Direct Mode err
  // regval = getreg32(STM32_DMA2_S0CR);
  // regval |= DMA_SCR_HTIE | DMA_SCR_TCIE | DMA_SCR_TEIE | DMA_SCR_DMEIE;
  // putreg32(regval, STM32_DMA2_S0CR);

  // Enable DMA Stream.
  regval = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

#endif    // #if ADC_TESTS_USE_DMA_TRANSFER > 0
}

//================================================================
// ORIGINAL ana_to_dig_conv_tests.c Entry point
  // (--) This part of the code could be called > 1 time when it supports more
  // than ADC1 for debugging. However the ADC reset done via RCC will only
  // need to be done once.
  // nuttx/arch/arm/src/stm32f7/chip/stm32f74xx77xx_adc.h
void meadow_adc_initialize(void)
{
  int ret;
  static bool firstTime = true;
  
  if(firstTime)
  {
    firstTime = false;
#if ADC_TESTS_USE_DMA_TRANSFER > 0
    _dmaHandle = NULL;
#endif
  }
  else
  {
    syslog(1, "Please, only once\n");
    return;
  }

  syslog(1, "--> Entered meadow_adc_initialize()\n"); usleep(20 * 1000);

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, adc_conversion_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
  }

  adc_initialize();

  adc_enable();

  dma_initialize();

  // adc_start();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);

  // ADC with DMA should be running at this point
  syslog(1, "--> Exiting ADC config\n"); usleep(20 * 1000);
}

#endif  // #if defined (CONFIG_ADC_TESTS)

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// NEW ENTRY POINT
// OPTION gpioList could require an 0xff terminator instead of gpioCount
// As few as 1 GPIO with 1 buffer element and as many as 16 GPIO with a buffer
// limit not specified.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          volatile uint16_t *dataBuffer, uint32_t convBuffSize)
{
  int ret;
  uint32_t gpioListOff;
  uint32_t mapOff = 0;

  // Populate global values
  _gpioList = gpioList;
  _gpioCount = gpioCount;
  _dmaDataBuffer = dataBuffer;

  syslog(1, "---meadow_adc configuration. gpioCount:%lu, convBufSize:%lu, BufferAddr:%p\n",
            gpioCount, convBuffSize, _dmaDataBuffer);
            
  // START OF ORIGINAL Works until following 6 lines exposed
  // Must have at least 1 entry per gpio
  if(gpioCount < convBuffSize)
  {
    syslog(1, "%s@%d-Error:gpioCount:%lu < convBuffSize:%lu\n",
              __FILE__, __LINE__, gpioCount, convBuffSize);
    return -EINVAL;   // Invalid argument
  }

  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for match
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        break;   // Found-it's connected to ADC
    }
  }

  // Did loop check all entries with no match?
  if(gpioListOff == gpioCount && mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
  {
    syslog(1, "%s@%d-Error:GPIO not found, gpioListOff:%lu, gpioCount:%lu, mapOff:%lu, MAP_LENGTH:%lu\n",
              __FILE__, __LINE__, gpioListOff, gpioCount,
              mapOff, MEADOW_ADC_GPIO_CHAN_MAP_LENGTH);
    return -EINVAL;   // Invalid argument
  }

  // Will the number of GPIOs exactly fill the provided buffer?
  if(gpioCount % convBuffSize != 0)
  {
    // Warning there will be empty array elements in the buffer after
    // conversion.
    syslog(1, "%s@%d-Warning:buffer size and the number of GPIOs not even multiple\n",
                __FILE__, __LINE__);
    return -1;
  }

// (--) TO DO - CALCULATE AND WARN AS THERE WILL BE UNFILLED ELEMENTS//
// How may cycles of conversion will fit in the provided data buffer


  // Only after conversion has finished
#if ADC_TESTS_DO_ONE_CONVERSION_AT_A_TIME > 0
  sem_init(&_waitTillDoneSem, 0, 1);
#endif
  meadow_adc_initialize();

  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  // Start a single conversion cycle
  adc_start();

  // Wait for conversion to finish
  DEBUG_SET_HIGH(DEBUG_PIN_V2_D03);
  meadow_adc_buffer_takesem(&_waitTillDoneSem);
  DEBUG_SET_LOW(DEBUG_PIN_V2_D03);

  return OK;
}

